Revit 2024 API
Sketch.GetAllElements Method
 Returns all elements which belong to the sketch.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022
Syntax
C#
public IList<ElementId> GetAllElements()
Visual Basic
Public Function GetAllElements As IList(Of ElementId)
Visual C++
public:
IList<ElementId^>^ GetAllElements()
Return Value
 Returns ids of elements which belong to that sketch.
Remarks
 Following elements can belong to a sketch: ModelCurve, ReferencePlane, Dimension. To get matching between Curve from Profile and ModelCurve, use [!:Autodesk::Revit::DB::Curve::Reference::ElementId].
See Also
Sketch Class
Autodesk.Revit.DB Namespace